Repository: AbdallahKhayat/Hajzi_Flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Home
ar: الصفحة الرئيسية

source: Profile
ar: معلومات شخصية

source: All Posts
ar: جميع المحلات

# newstory
source: New Post
ar: اضافة محل

source: Settings
ar: الاعدادات

source: Change Language
ar: تغير اللغة

# feedback
source: Hajzi Helper
ar: روبوت حجزي

source: Logout
ar: تسجيل الخروج

# about
source: About me
ar: معلومات عني

source: Name
ar: الاسم

source: Profession
ar: المهنة

source: DOB
ar: تاريخ الولادة

source: My Blogs
ar: محلاتي

source: Search Blogs
ar: ابحث عن المحلات

source: Requests
ar: طلبات

source: Customer
ar: ترقية لمتجر

source: BarberShop Posts
ar: محلات الحلاقة

source: Hospital Posts
ar: العيادات

source: Chat
ar: المحادثات

source: MyShops
ar: محلاتي

source: Users
ar: المستخدمين

# chooseMode
source: Choose Interaction Mode
ar: اختر نوع المحادثة

# aiMode
source: Chat with AI
ar: تكلم مع AI

# predefinedMode
source: Use Hajzi Questions
ar: استخدم اسئلة تطبيق حجزي

source: Search Shops
ar: ابحث عن المحلات هنا

source: Recommendations
ar: التوصيات

source: No Recommendations Yet
ar: لا يوجد توصيات في هذه اللحظة

source: All Shops
ar: جميع المحلات

source: Shop Details
ar: معلومات عن المحل

source: Find Me
ar: جدني هنا

source: Share
ar: نشر المحل

source: Book An Appointment
ar: احجز موعد

source: Book Appointment
ar: احجز

# bookingText
source: Click the button below to book or manage your appointments.
ar: انقر فوق الزر أدناه لحجز أو إدارة مواعيدك.

source: Available Slots
ar: التواقيت المتاحة

# noAvailableSlots
source: No Available time Slots
ar: لا يوجد تواقيت متاحة.

source: Book
ar: احجز

source: Confirm Booking
ar: تأكيد الحجز

# sureBooking
source: Are you sure you want to book an appointment at
ar: هل أنت متأكد أنك تريد حجز موعد على

source: Confirm
ar: متأكد

source: Manage Appointments
ar: إدارة المواعيد

source: Add Available Time
ar: إضافة وقت متاح

source: Opening
ar: البدء

source: Closing
ar: الإغلاق

source: Duration
ar: المدة

source: Add
ar: إضافة

source: Add Slots
ar: إضافة مواعيد

source: User
ar: الحاجز

source: Time
ar: الموعد

source: Status
ar: الحالة

source: Actions
ar: الإدارة

source: Available Slot
ar: موعد متاح

source: Available
ar: متاح

source: Booked
ar: محجوز

source: Confirm Deletion
ar: تأكيد حذف

source: Delete
ar: حذف

# sureDelete
source: Are you sure you want to delete the time slot at
ar: هل انت متأكد من حذف موعد الساعة

source: Booked by
ar: محجوز عن طريق

source: Select Language
ar: اختيار اللغة

# welcomeToHajziBot
source: Welcome to Hajzi Bot! How can I assist you today?
ar: مرحبًا بك في روبوت حجزي! كيف يمكنني مساعدتك اليوم؟

# transferToCustomer
source: Transfer to a Customer
ar: ترقية إلى صاحب المحل

# getAppAssistance
source: Get assistance with using the app
ar: الحصول على مساعدة في استخدام التطبيق

source: Contact admin
ar: الاتصال بالإدارة

# hajziBotAIMode
source: AI Mode
ar: وضع الذكاء الاصطناعي

# hajziBotHelpMode
source: Help Mode
ar: وضع المساعدة

source: Type your message...
ar: اكتب رسالتك...

# bookAppointmentHelp
source: You can book an appointment by pressing on a specific shop from the Home page and press Book Appointment. Then choose the available times. If you need any further help, let me know 😊
ar: يمكنك حجز موعد بالضغط على محل معين من الصفحة الرئيسية والضغط على حجز موعد. ثم اختر الأوقات المتاحة. إذا كنت بحاجة إلى مزيد من المساعدة، أخبرني 😊

# transferToCustomerHelp
source: You can transfer to Customer by clicking on Customer from the App's menu. Then it will ask for the payment method. If you need any further help, let me know 😊
ar: يمكنك التحويل إلى صاحب المحل بالنقر على صاحب المحل من قائمة التطبيق. ثم سيتم طلب طريقة الدفع. إذا كنت بحاجة إلى مزيد من المساعدة، أخبرني 😊

# appAssistanceHelp
source: To get assistance with using the app, please visit our Help Center or contact support.
ar: للحصول على مساعدة في استخدام التطبيق، يرجى زيارة مركز المساعدة أو الاتصال بالدعم.

# contactAdminHelp
source: You can contact the admin at: 0597754602
ar: يمكنك التواصل مع الإدارة على: 0597754602/0597931703

# invalidOption
source: Please select a valid option from the list provided.
ar: يرجى اختيار خيار متوفر من القائمة المقدمة.

source: Me
ar: أنا

source: Hajzi Bot
ar: روبوت حجزي

# pickThemeColor
source: Pick a Theme Color
ar: اختر لون الواجهة

source: Select
ar: اختيار

source: Create Post
ar: إنشاء منشور

source: Preview
ar: عرض المحل

source: Post Title
ar: عنوان المنشور

source: General
ar: عام

source: Barbershop
ar: محل حلاقة

source: Hospital
ar: عيادة

source: Add Image and Title
ar: أضف صورة وعنوان

source: Post Content
ar: محتوى المنشور

# provideBlogBody
source: Provide Body of Your Blog
ar: قدم محتوى المحل

source: Select Shop Location
ar: اختر موقع المحل

source: Add Shop
ar: إضافة المحل

source: Select Role
ar: اختر الدور

# fillAllFieldsAndSelectImage
source: Please fill in all fields and select at least one image
ar: يرجى ملء جميع الحقول واختيار صورة واحدة على الأقل

source: No images selected
ar: لم يتم اختيار صور

source: Location Selected
ar: الموقع المختار

# titleCannotBeEmpty
source: Title can't be empty
ar: العنوان لا يمكن أن يكون فارغًا

# titleCannotExceed100Chars
source: Title can't be more than 100 characters
ar: العنوان لا يمكن أن يتجاوز 100 حرف

# bodyCannotBeEmpty
source: Body can't be empty
ar: المحتوى لا يمكن أن يكون فارغًا

source: Confirm Submission
ar: تأكيد الإرسال

# areYouSureSubmitShop
source: Are you sure you want to submit this Shop?
ar: هل أنت متأكد أنك تريد تثبيت هذا المحل؟

source: Submit
ar: إرسال

source: Edit Email
ar: تعديل البريد الإلكتروني

source: Email
ar: البريد الإلكتروني

source: Save
ar: حفظ

source: (min)
ar: (دقائق)

source: Dashboard
ar: لوحة المعلومات

source: Total Users
ar: إجمالي المستخدمين

source: Total Customers
ar: إجمالي مالكي المحلات

source: Revenue
ar: الأرباح

source: Users and Customers
ar: المستخدمين واصحاب المحلات

source: Username
ar: اسم المستخدم

source: Role
ar: الدور

source: Created At
ar: تاريخ الإنشاء

# translateRole
source: {role, select, customer {Customer} user {User} other {Unknown}}
ar: {role, select, customer {صاحب محل} user {مستخدم} other {غير معروف}}

# typeMessage
source: Type a message
ar: اكتب رسالة

source: Hajzi Chats (Web)
ar: محادثات حجزي (ويب)

source: Hajzi Chats
ar: محادثات حجزي

source: CHATS
ar: الدردشات

source: Search for customers...
ar: ابحث عن المحلات...

source: No shops found
ar: لم يتم العثور على محلات

source: No matching shops
ar: لا توجد محلات مطابقة

# slide1Title
source: Welcome to Our App!
ar: مرحبًا بك في تطبيقنا!

# slide1Description
source: Discover amazing features tailored for you.
ar: اكتشف ميزات مذهلة مُصممة خصيصًا لك.

# slide2Title
source: Stay Connected
ar: ابقَ على تواصل

# slide2Description
source: Search for the Place you would like to Appoint with.
ar: ابحث عن المكان الذي ترغب في حجز موعد فيه.

# slide3Title
source: Appoint Now
ar: احجز الآن

# slide3Description
source: After Clicking the Place, Appoint now And enjoy saving time
ar: بعد النقر على المكان، احجز الآن واستمتع بتوفير الوقت

# slide4Title
source: Achieve More
ar: حقق المزيد

# slide4Description
source: Upgrade to Customer to achieve more features like adding your own Place.
ar: قم بالترقية إلى صاحب محل لتحقيق مزايا إضافية مثل إضافة مكانك الخاص.

source: Finish
ar: إنهاء

source: Get Started
ar: ابدأ

# welcome1
source: Reserve Now From Your Home!
ar: ! احجز الآن من منزلك

source: Sign up with Google
ar: سجل باستخدام جوجل

source: Sign up with Facebook
ar: سجل باستخدام فيسبوك

source: Sign up with Email
ar: سجل عبر البريد الإلكتروني

source: Already have an account?
ar: هل لديك حساب بالفعل؟

source: Sign In
ar: تسجيل الدخول

source: Go to Current Location
ar: اذهب إلى الموقع الحالي

# searchLocation
source: Search for a location
ar: ابحث عن موقع

source: Search
ar: ابحث

source: No results found in Palestine
ar: لم يتم العثور على نتائج في فلسطين

source: Error fetching results
ar: حدث خطأ أثناء جلب النتائج

source: Could not open Google Maps
ar: تعذر فتح خرائط جوجل

source: Open in Google Maps
ar: افتح في خرائط جوجل

source: Confirm Location
ar: تأكيد الموقع

source: Shop Location
ar: موقع المحل

source: Upgrade To Customer
ar: الترقية إلى متجر

source: Search Users...
ar: ابحث عن المستخدمين...

# usernameLabel
source: Username
ar: اسم المستخدم:

# emailLabel
source: Email
ar: البريد الإلكتروني:

# roleLabel
source: Role
ar: الدور

# statusLabel
source: Status
ar: الحالة

source: Banned
ar: محظور

source: Active
ar: نشط

source: Ban
ar: حظر

source: Unban
ar: رفع الحظر

source: Promote
ar: ترقية

source: Unpromote
ar: إلغاء الترقية

source: User Profile
ar: ملف المستخدم

source: Unknown
ar: غير معروف

# professionLabel
source: Profession
ar: المهنة

# dobLabel
source: DOB
ar: تاريخ الميلاد

# titlelineLabel
source: Titleline
ar: عنوان

# aboutLabel
source: About
ar: حول

# notAvailable
source: N/A
ar: غير متوفر

source: Confirm Ban
ar: تأكيد الحظر

source: Confirm Unban
ar: تأكيد رفع الحظر

# areYouSureBan
source: Are you sure you want to ban {email}?
ar: هل أنت متأكد أنك تريد حظر {email}؟

# areYouSureUnban
source: Are you sure you want to unban {email}?
ar: هل أنت متأكد أنك تريد رفع الحظر عن {email}؟

# areYouSureChangeRole
source: Are you sure you want to change {email} to the role of {newRole}?
ar: هل أنت متأكد أنك تريد تغيير دور {email} إلى {newRole}؟

# failedToUpdateRole
source: Failed to update user role.
ar: فشل في تحديث دور المستخدم.

# errorUpdatingRole
source: An error occurred while updating the user role.
ar: حدث خطأ أثناء تحديث دور المستخدم.

# userStatusUpdated
source: User status updated successfully!
ar: تم تحديث حالة المستخدم بنجاح!

# failedToUpdateStatus
source: Failed to update user status.
ar: فشل في تحديث حالة المستخدم.

# errorUpdatingStatus
source: An error occurred while updating the user status.
ar: حدث خطأ أثناء تحديث حالة المستخدم.

source: Profile Required
ar: المطلوب إنشاء ملف

# pleaseCreateProfile
source: Please create a profile before upgrading to Customer.
ar: يرجى إنشاء ملف قبل الترقية إلى صاحب محل.

source: Create Profile
ar: إنشاء ملف

source: No users found
ar: لم يتم العثور على مستخدمين

source: Notifications
ar: الإشعارات

source: No notifications available
ar: لا توجد إشعارات متوفرة

source: Notification Deleted
ar: تم حذف الإشعار

source: Notification deleted successfully!
ar: تم حذف الإشعار بنجاح!

# failedToDeleteNotification
source: Failed to delete the notification.
ar: فشل في حذف الإشعار.

# errorDeletingNotification
source: An error occurred while deleting the notification.
ar: حدث خطأ أثناء حذف الإشعار.

# predefinedMode1
source: Hajzi Predefined Questions
ar: الأسئلة المُعدة مسبقاً لحجزي

source: Edit Shop
ar: تعديل المحل

source: Updating Shop...
ar: جارٍ تحديث المحل...

# pleaseWaitMagicHappening
source: Please wait, magic is happening...
ar: يرجى الانتظار، السحر يحدث...

source: Type
ar: النوع

source: Title
ar: العنوان

source: Body
ar: المحتوى

source: Preview Image
ar: الصورة المعاينة

source: No preview image selected
ar: لم يتم اختيار صورة معاينة

source: Change Preview Image
ar: تغيير الصورة المعاينة

source: Slideshow Images
ar: صور العرض

source: Add New Images
ar: إضافة صور جديدة

source: Save Changes
ar: حفظ التغييرات

source: Failed to remove image
ar: فشل في إزالة الصورة

source: Shop Updated
ar: تم تحديث المحل

source: Shop updated successfully!
ar: تم تحديث المحل بنجاح!

source: OK
ar: حسناً

source: Error updating shop
ar: حدث خطأ أثناء تحديث المحل

source: Close
ar: إغلاق

source: User Status Update
ar: تحديث حالة المستخدم

# userStatusUpdatedSuccessfully
source: {email} status updated successfully!
ar: {email} تم تحديث حالته بنجاح!

source: status updated successfully!
ar: تم تحديث الحالة بنجاح!

source: Role Update
ar: تحديث الدور

# roleUpdatedSuccessfully
source: {email} role updated successfully!
ar: تم تحديث دور {email} بنجاح!

source: Cancel
ar: إلغاء

source: Revenue (Last 7 Days)
ar: الأرباح (آخر 7 أيام)

source: Daily Revenue (Bar Chart)
ar: الأرباح اليومية (رسم بياني شريطي)

# noRevenueDataLast7Days
source: No revenue data for the last 7 days
ar: لا توجد بيانات أرباح لآخر 7 أيام

source: No revenue data available
ar: لا توجد بيانات أرباح متوفرة

source: No chats available
ar: لا توجد دردشات متوفرة

# selectUserToChat
source: Select a user to start chatting
ar: اختر مستخدمًا للبدء بالدردشة

source: Copied to clipboard
ar: تم النسخ للحافظة

source: Copy
ar: نسح

# messageDeleted
source: Message has been deleted
ar: تم حذف الرسالة

source: Error deleting message
ar: حدث خطأ أثناء حذف الرسالة

# messageDeletedSuccess
source: Message deleted
ar: تم حذف الرسالة

source: Failed to delete message
ar: فشل في حذف الرسالة

# failedToCreateChat
source: Failed to create chat. Please try again.
ar: فشل في إنشاء الدردشة. يرجى المحاولة مرة أخرى.

# failedToSendMessage
source: Failed to send message. Please try again.
ar: فشل في إرسال الرسالة. يرجى المحاولة مرة أخرى.

# cameraGalleryPermission
source: Camera or Gallery permission is required
ar: مطلوب إذن الكاميرا أو المعرض

source: Audio Recorded
ar: تم تسجيل الصوت

# sendAudioMessageQuestion
source: Do you want to send this audio message?
ar: هل تريد إرسال رسالة الصوت هذه؟

source: Send
ar: إرسال

# failedToSendAudio
source: Failed to send audio. Please try again.
ar: فشل في إرسال الصوت. يرجى المحاولة مرة أخرى.

source: Choose Image From
ar: اختر الصورة من

source: View Contact
ar: عرض جهة الاتصال

# mediaLinksDocs
source: Media, links, and docs
ar: الوسائط والروابط والمستندات

source: Hajzi web
ar: حجزي ويب

source: Mute Notifications
ar: كتم الإشعارات

source: Wall Paper
ar: خلفية

source: Document
ar: مستند

source: Camera
ar: كاميرا

source: Gallery
ar: معرض

source: Audio
ar: صوت

source: Location
ar: الموقع

source: Contact
ar: جهة الاتصال

# transferPaymentHelp
source: To transfer to Customer, please complete your payment. Click the button below to open the payment page.
ar: لنقل إلى المتجر، يرجى إتمام عملية الدفع. اضغط على الزر أدناه لفتح صفحة الدفع.

# requestNotProcessed
source: Sorry, I couldn't process your request at the moment.
ar: عذرًا، لم أتمكن من معالجة طلبك في الوقت الحالي.

# requestProcessingError
source: An error occurred while trying to process your request.
ar: حدث خطأ أثناء محاولة معالجة طلبك.

source: Browse All Shops
ar: تصفح جميع المحلات

# payAndUpgrade
source: Pay & Upgrade
ar: الدفع والترقية

# deleteChatHistoryTitle
source: Delete Chat History
ar: حذف سجل الدردشة

# deleteChatHistoryContent
source: Are you sure you want to delete the chat history?
ar: هل أنت متأكد من أنك تريد حذف سجل الدردشة؟

# featureNotProvided
source: Feature not provided yet
ar: الميزة غير متوفرة بعد

source: Congratulations!
ar: تهانينا!

# upgradeSuccess
source: You have successfully upgraded to Customer.
ar: لقد تم ترقيتك بنجاح إلى المتجر.

# alreadyCustomer
source: Already a Customer
ar: أنت مشترك بالفعل

# alreadyRegisteredCustomer
source: You are already a registered customer.
ar: أنت مسجل كصاحب محل بالفعل.

# methodNotAvailableOnWeb
source: This method isn't currently available on WEB, please switch to the mobile app.
ar: هذه الطريقة غير متوفرة حاليًا على الويب، يرجى التبديل إلى التطبيق المحمول.

source: Failed to update shop status.
ar: فشل في تحديث حالة المحل.

source: Failed to fetch blog requests
ar: فشل في جلب طلبات المدونة

source: Shop Status Updated
ar: تم تحديث حالة المحل

# shopStatusUpdatedMessage
source: The shop with title: {shopTitle} status has been updated to {status}.
ar: تم تحديث حالة المحل الذي يحمل العنوان: {shopTitle} إلى {status}.

source: Search by title...
ar: ابحث حسب العنوان...

source: No Shop requests found
ar: لم يتم العثور على طلبات متاجر

source: Untitled Blog
ar: مدونة بدون عنوان

source: No content available
ar: لا يوجد محتوى متاح

source: Approve
ar: الموافقة

source: Deny
ar: رفض

source: View Details
ar: عرض التفاصيل

source: Details
ar: التفاصيل

source: No preview image uploaded.
ar: لم يتم رفع صورة معاينة.

source: Cover Images:
ar: صور الغلاف:

source: No cover images uploaded.
ar: لم يتم رفع صور الغلاف.

# profileDataAvailable
source: Profile data is available
ar: معلومات الملف الشخصي متوفرة

# addProfileInfo
source: Tap the button below to add your profile data
ar: اضغط على الزر أدناه لإضافة بيانات ملفك الشخصي

source: Add Profile
ar: أضف الملف الشخصي

source: Email not available
ar: البريد الإلكتروني غير متوفر

source: Title line not available
ar: لا يوجد عنوان متوفر

source: No Image Available
ar: لا توجد صورة متاحة

source: No information available
ar: لا توجد معلومات متوفرة

source: No name provided
ar: لم يتم توفير اسم

source: No profession listed
ar: لم يتم ذكر المهنة

# noDOBProvided
source: No date of birth provided
ar: لم يتم توفير تاريخ الميلاد

source: Edit Profile
ar: تحرير الملف الشخصي

source: Titleline
ar: عنوان المهنة / المسمى الوظيفي

source: Please enter {field}
ar: يرجى إدخال {field}

source: Image upload failed!
ar: فشل في رفع الصورة!

source: Profile Updated
ar: تم تحديث الملف الشخصي

# profileUpdatedSuccess
source: Your profile has been updated successfully!
ar: تم تحديث ملفك الشخصي بنجاح!

source: Update Failed
ar: فشل التحديث

# updateFailedMessage
source: Update failed! Please try again.
ar: فشل التحديث! يرجى المحاولة مرة أخرى.

# errorOccurred
source: An error occurred: {error}
ar: حدث خطأ: {error}

source: Choose Profile Photo
ar: اختر صورة الملف الشخصي

# nameEmpty
source: Name can't be empty
ar: الاسم لا يمكن أن يكون فارغًا

# nameHelper
source: Name can't be empty
ar: الاسم لا يمكن أن يكون فارغًا

# nameHint
source: Ex: Jack David
ar: مثال: محمد فايز

# professionEmpty
source: Profession can't be empty
ar: المهنة لا يمكن أن تكون فارغة

# professionHelper
source: Profession can't be empty
ar: المهنة لا يمكن أن تكون فارغة

# professionHint
source: Ex: Dentist
ar: مثال: طبيب أسنان

# dobEmpty
source: DOB can't be empty
ar: تاريخ الميلاد لا يمكن أن يكون فارغًا

# dobHelper
source: Provide DOB in dd/mm/yyyy format
ar: يرجى تقديم تاريخ الميلاد بصيغة dd/mm/yyyy

# dobHint
source: Ex: 17/08/2002
ar: مثال: 17/08/2002

# titleEmpty
source: Title can't be empty
ar: العنوان لا يمكن أن يكون فارغًا

# titleHelper
source: Title can't be empty
ar: العنوان لا يمكن أن يكون فارغًا

# titleHint
source: Ex: Clinical dentist
ar: مثال: مختص في جراحة الفم و الاسنان

# aboutEmpty
source: About can't be empty
ar: حول لا يمكن أن يكون فارغًا

# aboutHelper
source: Write about yourself (optional)
ar: اكتب شيئًا عن نفسك (اختياري)

# aboutHint
source: Ex: I am a specialized dentist and have my own clinic which i opened in 2020
ar: مثال: أعمل كطبيب اسنان منذ 4 سنوات و عندي عيادتي الخاصة

source: Something went wrong
ar: حدث خطأ ما

source: Failed to fetch available slots
ar: فشل في جلب المواعيد المتاحة

# alreadyBooked
source: You have already booked an appointment.
ar: لقد قمت بحجز موعد بالفعل.

source: Appointment booked successfully!
ar: تم حجز الموعد بنجاح!

source: Failed to book appointment.
ar: فشل في حجز الموعد.

# errorBookingAppointment
source: An error occurred while booking the appointment.
ar: حدث خطأ أثناء حجز الموعد.

source: Expired
ar: منتهية

# methodUnavailableOnWeb
source: This method isn't currently available on WEB, please switch to the mobile app.
ar: هذه الطريقة غير متوفرة حاليًا على الويب، يرجى التبديل إلى التطبيق المحمول.

source: Forgot Password
ar: نسيت كلمة المرور

# emailEmpty
source: Email can’t be empty!
ar: البريد الإلكتروني لا يمكن أن يكون فارغًا!

source: Invalid email!
ar: البريد الإلكتروني غير صالح!

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Enter your new password
ar: أدخل كلمة المرور الجديدة

source: Verify Email
ar: تأكيد البريد الإلكتروني

source: Update Password
ar: تحديث كلمة المرور

source: Please verify your email!
ar: يرجى التحقق من بريدك الإلكتروني!

source: Password updated successfully!
ar: تم تحديث كلمة المرور بنجاح!

# passwordEmpty
source: Password cannot be empty
ar: لا يمكن أن تكون كلمة المرور فارغة

# passwordMinLength
source: Password must be at least 8 characters
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل

# verifyYourEmail
source: Verification email sent!
ar: تم إرسال بريد إلكتروني للتحقق!

source: Welcome Back!
ar: مرحباً بعودتك!

source: Sign in to continue
ar: قم بتسجيل الدخول للاستمرار

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Enter your password
ar: أدخل كلمة المرور

source: Sign In
ar: تسجيل الدخول

source: Forgot Password?
ar: نسيت كلمة المرور؟

# dont_have_account
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: سجل

source: Complete Your Profile
ar: أكمل ملفك الشخصي

# please_create_profile
source: Please create your profile to continue using the app.
ar: يرجى إنشاء ملفك الشخصي للاستمرار باستخدام التطبيق.

source: Create Profile
ar: إنشاء الملف الشخصي

source: Account Banned
ar: تم حظر الحساب

source: Enter your username
ar: أدخل اسم المستخدم الخاص بك

source: Invalid email!
ar: البريد الإلكتروني غير صالح!

source: Email can't be empty!
ar: لا يمكن أن يكون البريد الإلكتروني فارغًا!

# outputMessage
source: Your account has been banned. Contact support.
ar: تم حظر حسابك. اتصل بالدعم.

# create_account
source: Create an Account
ar: إنشاء حساب

# sign_up_get_started
source: Sign up to get started
ar: سجل للبدء

# username_empty
source: Username can’t be empty
ar: اسم المستخدم لا يمكن أن يكون فارغاً

# email_empty
source: Email can’t be empty!
ar: البريد الإلكتروني لا يمكن أن يكون فارغاً!

# password_empty
source: Password can’t be empty!
ar: كلمة المرور لا يمكن أن تكون فارغة!

# password_min_length
source: Password must be at least 8 characters!
ar: يجب أن تتكون كلمة المرور من 8 أحرف على الأقل!

# email_taken
source: Email already taken
ar: البريد الإلكتروني مستخدم

# error_checking_email
source: Error checking email. Try again.
ar: خطأ في التحقق من البريد الإلكتروني. حاول مرة أخرى.

# network_error
source: Network error. Please try again later.
ar: خطأ في الشبكة. يرجى المحاولة لاحقاً.

# verification_email_sent
source: Verification email sent! Please verify your email before logging in.
ar: تم إرسال رسالة تحقق. يرجى التحقق من بريدك الإلكتروني قبل تسجيل الدخول.

# already_have_account
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# error_sending_email
source: Error while sending email
ar: حدث خطأ أثناء إرسال البريد الإلكتروني

# verification_email_resent
source: Verification email has been sent.
ar: تم إعادة إرسال رسالة التحقق.

# verify_email_instruction
source: Please verify your email. Check your inbox and click 'I Have Verified' once you complete verification.
ar: يرجى التحقق من بريدك الإلكتروني. تحقق من صندوق الوارد واضغط على 'لقد تحققت' بعد إتمام عملية التحقق.

source: I Have Verified
ar: لقد تحققت

source: Resend Verification Email
ar: إعادة إرسال رسالة التحقق

# complete_profile
source: Complete Your Profile
ar: أكمل ملفك الشخصي

# create_profile_prompt
source: Please create your profile to continue using the app.
ar: يرجى إنشاء ملفك الشخصي للاستمرار في استخدام التطبيق.

source: Rate This Shop:
ar: قيّم هذا المحل:

# already_rated_message
source: You have already rated this shop.
ar: لقد قمت بالتقييم مسبقاً لهذا المحل.

# average_rating_label
source: Average Rating:
ar: متوسط التقييم:

# number_of_ratings_label
source: Number of Ratings:
ar: عدد التقييمات:

source: Next appointment in
ar: الموعد التالي خلال

source: No appointments scheduled
ar: لا توجد مواعيد مجدولة

source: No upcoming appointments today
ar: لا توجد مواعيد قادمة اليوم

# noUpcomingAppointments
source: No upcoming appointments at this moment
ar: لا توجد مواعيد قادمة في الوقت الحالي

# error_fetching_profile
source: Error fetching user profile
ar: حدث خطأ أثناء جلب بيانات المستخدم

source: No appointments booked
ar: لا يوجد مواعيد محجوزة

source: Edit Time & Duration
ar: تحرير الوقت والمدة

# timeLabel
source: Time (HH:mm)
ar: الوقت (HH:mm)

# durationLabel
source: Duration (min)
ar: المدة (دقيقة)

# validTime
source: Please select a valid time
ar: الرجاء تحديد وقت صالح

# timeSlotDeleted
source: Time slot deleted successfully!
ar: تم حذف الموعد بنجاح!

# timeSlotUpdated
source: Time slot updated successfully!
ar: تم تحديث الموعد بنجاح!
