Repository: AbdallahKhayat/Hajzi_Flutter
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Email updated successfully
ar: تم تحديث البريد الإلكتروني بنجاح

source: Select Time
ar: اختر الوقت

# noPermissionToDeleteBlog
source: You don’t have permission to delete this blog
ar: ليس لديك الإذن لحذف هذا المتجر

source: Deletion Successful
ar: تم الحذف بنجاح

# shopDeletedSuccessfully
source: The Shop with title:
ar: تم حذف المحل بعنوان:

# successfullyDeleted
source: has been deleted successfully!
ar: بنجاح!

# deleteShopConfirmationWithTitle
source: Are you sure you want to delete the Shop with title:
ar: هل أنت متأكد أنك تريد حذف المحل بعنوان:

source: Submission Successful
ar: تم الإرسال بنجاح

# shopSubmittedForApproval
source: Your shop has been submitted for approval!
ar: لقد تم تقديم متجرك للموافقة!

source: Failed to create shop
ar: فشل في إنشاء المتجر

source: Shop created successfully!
ar: تم إنشاء المتجر بنجاح!

# shopUploading
source: Your Shop is Uploading...
ar: يتم تحميل محلك...
